org/PythonSetup.org
# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+startup: overview indent auto-fill
#+export_file_name: ../html/PythonSetup.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

#+title: Python Setup
#+author: Dr. E.P. Blair



* Direnv Setup and Python Environment                              :noexport:

** A Sample =.envrc= File

This file may be tangled using =C-u C-c C-v t=:
#+begin_src bash :padline none :tangle "./.envrc"
# Activate Python virtual environment
#   If it doesn't exist, this createa virtual env
#   in ./.direnv/python-3.11/
layout python

# Specify Python version if required (optional)
# layout python <python_version>

# Automatically add project's src folder to PYTHONPATH
# This may not be neccessary
export PYTHONPATH=$PWD/src:$PYTHONPATH

# Load environment variables from a .env file, if it exists
if [[ -f .env ]]; then
  dotenv
fi

# Additional Zsh-specific configurations (if any)
# Example: Zsh-specific exports or aliases
export ZSH_ENV_VAR="SomeValue"

#+end_src



#+begin_src emacs-lisp :eval never
(setq-local org-babel-python-command "/path/to/envname/bin/python3")
#+end_src


* Installing Python

** Background
- The objective here is to install a verion of Python and to create a virtual
  environment.
*** Virtual Environments
- You can use Python /without/ virtual environments, but things can get messy
  quickly
  - We typically add Python packages to extend its capabilities
  - Sometimes, different projects require different packages
    - Packages may conflict, or different projects may even require /different/
      versions of the same package, or even different versions of Python
    - Example: Suppose Project A requires packages W, U, and V, but Project B requires
      packages V, X, and Y. Some conflicts that can arise:
      - Package X may be incompatible with package U, rendering your code for
        Project A unusable. Remove package U, and you can no longer work on
        Project B
      - Project A and Project B might require different versions of package V
      - Project A and Project B might require different versions of Python
- To prevent such conflicts, it is customary to use *virtual environments*
  - A virtual environment is like a custom installation of Python with only those
    packages required for a specific project or application

*** Creating and Using Virtual Environments
- There are multiple ways to create virtual environments
  - Use the standard Python approach
    - Create virtual environments for Python versions previously installed on
      your computer
    - Advantages of the standard Python approach:
      - Access to the latest packages from [[https://pypi.org][pip]] utility
  - Use Conda
    - Conda creates and manages *environments*, which are similar to virtual
      environments, with some improvements
      - Added flexibility. You can create virtual environments that use Python
        versions not yet installed on your computer
      - Use the ~conda~ utility to manage environments, add/remove packages, etc.
      - Environments are journaled, so that you can return to a previous version
        of your environment
        - This is useful if you install package Y, but it conflicts with other
          packages in your environment
        - You can simply restore your environment to an earlier version
    - Drawbacks
      - Packages on [[https://conda-forge.org][conda-forge]], the package repository for ~conda~ may not be up to
        date with the ones on PyPI, the repository for standard Python packages
        - You can still install packages from PyPI in ~conda~ environments, however
*** Benefits of Using Python Virtual Environments

**** Why Use Virtual Environments in Python?
***** Isolation of Dependencies
- Avoid conflicts between package versions required by different projects.
- Each project can have its own dependencies without interfering with others.

***** Consistency Across Environments
- Reproduce the same environment for development, testing, and production.
- Ensure compatibility and avoid "it works on my machine" problems.

***** Simplified Dependency Management
- Install project-specific packages without requiring administrative privileges.
- Cleanly manage updates or removals of packages for a single project.

***** Protection of Global Python Environment
- Prevent unintended modifications to the global Python environment.
- Avoid accidental installation of packages that could affect other projects.

***** Flexibility with Python Versions
- Use different Python versions for different projects.
- Test projects under multiple Python versions without conflicts.

***** Integration with Development Tools
- Tools like Jupyter, nbgrader, and linters work seamlessly with the virtual environment.
- Specific configurations (e.g., pylint, mypy) can be tied to the project environment.

***** Ease of Collaboration
- Use a `requirements.txt` or `pyproject.toml` file to share the exact environment with team members.
- Simplifies onboarding for new collaborators.

***** Best Practices
- Always activate the virtual environment when working on the project.
- Use tools like `venv`, `virtualenv`, or `conda` to create and manage environments.
- Leverage environment management tools like `direnv` for seamless activation.
** Procedure
