html/PythonSetup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 10:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Setup</title>
<meta name="author" content="Dr. E.P. Blair" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python Setup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8fa405e">1. Installing Python</a>
<ul>
<li><a href="#org6ffe679">1.1. Background</a>
<ul>
<li><a href="#org7b82788">1.1.1. Virtual Environments</a></li>
<li><a href="#org50c5a7b">1.1.2. Creating and Using Virtual Environments</a></li>
<li><a href="#org885c0ec">1.1.3. Benefits of Using Python Virtual Environments</a></li>
</ul>
</li>
<li><a href="#orgb314eea">1.2. Procedure</a>
<ul>
<li><a href="#orge5762a7">1.2.1. Overview</a></li>
<li><a href="#org4a589db">1.2.2. Anaconda Installation</a></li>
<li><a href="#org0399c3c">1.2.3. Miniconda Installation</a></li>
<li><a href="#orga397b21">1.2.4. Standard Python Installation</a></li>
</ul>
</li>
<li><a href="#orgd303da5">1.3. Test Your Python Installation</a>
<ul>
<li><a href="#org71b7876">1.3.1. A Hello World Program</a></li>
<li><a href="#org2dfc9d8">1.3.2. Python Version Check</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org48b696a">2. Set Up a Python Environment</a>
<ul>
<li><a href="#org1ecd347">2.1. Overview</a></li>
<li><a href="#org2e79bc1">2.2. Conda: Create an Environment</a></li>
<li><a href="#org3186b94">2.3. Activate your Environment (Conda)</a></li>
<li><a href="#org6c7b651">2.4. Installing Packages</a>
<ul>
<li><a href="#org904c430">2.4.1. Install Packages from <code>requirements.txt</code> (Recommended)</a></li>
<li><a href="#orgc59427a">2.4.2. Manual Install</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org8fa405e" class="outline-2">
<h2 id="org8fa405e"><span class="section-number-2">1.</span> Installing Python</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6ffe679" class="outline-3">
<h3 id="org6ffe679"><span class="section-number-3">1.1.</span> Background</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The objective here is to install a verion of Python and to create a virtual
environment.</li>
</ul>
</div>
<div id="outline-container-org7b82788" class="outline-4">
<h4 id="org7b82788"><span class="section-number-4">1.1.1.</span> Virtual Environments</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>You can use Python <i>without</i> virtual environments, but things can get messy
quickly
<ul class="org-ul">
<li>We typically add Python packages to extend its capabilities</li>
<li>Sometimes, different projects require different packages
<ul class="org-ul">
<li>Packages may conflict, or different projects may even require <i>different</i>
versions of the same package, or even different versions of Python</li>
<li>Example: Suppose Project A requires packages W, U, and V, but Project B requires
packages V, X, and Y. Some conflicts that can arise:
<ul class="org-ul">
<li>Package X may be incompatible with package U, rendering your code for
Project A unusable. Remove package U, and you can no longer work on
Project B</li>
<li>Project A and Project B might require different versions of package V</li>
<li>Project A and Project B might require different versions of Python</li>
</ul></li>
</ul></li>
</ul></li>
<li>To prevent such conflicts, it is customary to use <b>virtual environments</b>
<ul class="org-ul">
<li>A virtual environment is like a custom installation of Python with only those
packages required for a specific project or application</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org50c5a7b" class="outline-4">
<h4 id="org50c5a7b"><span class="section-number-4">1.1.2.</span> Creating and Using Virtual Environments</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>There are multiple ways to create virtual environments
<ul class="org-ul">
<li>Use the standard Python approach
<ul class="org-ul">
<li>Create virtual environments for Python versions previously installed on
your computer</li>
<li>Advantages of the standard Python approach:
<ul class="org-ul">
<li>Access to the latest packages from <a href="https://pypi.org">pip</a> utility</li>
</ul></li>
</ul></li>
<li>Use Conda
<ul class="org-ul">
<li>Conda creates and manages <b>environments</b>, which are similar to virtual
environments, with some improvements
<ul class="org-ul">
<li>Added flexibility. You can create virtual environments that use Python
versions not yet installed on your computer</li>
<li>Use the <code>conda</code> utility to manage environments, add/remove packages, etc.</li>
<li>Environments are journaled, so that you can return to a previous version
of your environment
<ul class="org-ul">
<li>This is useful if you install package Y, but it conflicts with other
packages in your environment</li>
<li>You can simply restore your environment to an earlier version</li>
</ul></li>
</ul></li>
<li>Drawbacks
<ul class="org-ul">
<li>Packages on <a href="https://conda-forge.org">conda-forge</a>, the package repository for <code>conda</code> may not be up to
date with the ones on PyPI, the repository for standard Python packages
<ul class="org-ul">
<li>You can still install packages from PyPI in <code>conda</code> environments, however</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org885c0ec" class="outline-4">
<h4 id="org885c0ec"><span class="section-number-4">1.1.3.</span> Benefits of Using Python Virtual Environments</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org681e221"></a>Why Use Virtual Environments in Python?<br />
<ol class="org-ol">
<li><a id="orgbb2228c"></a>Isolation of Dependencies<br />
<div class="outline-text-6" id="text-1-1-3-1-1">
<ul class="org-ul">
<li>Avoid conflicts between package versions required by different projects.</li>
<li>Each project can have its own dependencies without interfering with others.</li>
</ul>
</div>
</li>

<li><a id="org9935c03"></a>Consistency Across Environments<br />
<div class="outline-text-6" id="text-1-1-3-1-2">
<ul class="org-ul">
<li>Reproduce the same environment for development, testing, and production.</li>
<li>Ensure compatibility and avoid "it works on my machine" problems.</li>
</ul>
</div>
</li>

<li><a id="orga24ba7c"></a>Simplified Dependency Management<br />
<div class="outline-text-6" id="text-1-1-3-1-3">
<ul class="org-ul">
<li>Install project-specific packages without requiring administrative privileges.</li>
<li>Cleanly manage updates or removals of packages for a single project.</li>
</ul>
</div>
</li>

<li><a id="orgdaccb2e"></a>Protection of Global Python Environment<br />
<div class="outline-text-6" id="text-1-1-3-1-4">
<ul class="org-ul">
<li>Prevent unintended modifications to the global Python environment.</li>
<li>Avoid accidental installation of packages that could affect other projects.</li>
</ul>
</div>
</li>

<li><a id="orgcdac96b"></a>Flexibility with Python Versions<br />
<div class="outline-text-6" id="text-1-1-3-1-5">
<ul class="org-ul">
<li>Use different Python versions for different projects.</li>
<li>Test projects under multiple Python versions without conflicts.</li>
</ul>
</div>
</li>

<li><a id="orgcc35fd5"></a>Integration with Development Tools<br />
<div class="outline-text-6" id="text-1-1-3-1-6">
<ul class="org-ul">
<li>Tools like Jupyter, nbgrader, and linters work seamlessly with the virtual environment.</li>
<li>Specific configurations (e.g., pylint, mypy) can be tied to the project environment.</li>
</ul>
</div>
</li>

<li><a id="orgd56192c"></a>Ease of Collaboration<br />
<div class="outline-text-6" id="text-1-1-3-1-7">
<ul class="org-ul">
<li>Use a `requirements.txt` or `pyproject.toml` file to share the exact environment with team members.</li>
<li>Simplifies onboarding for new collaborators.</li>
</ul>
</div>
</li>

<li><a id="orgd94e8f5"></a>Best Practices<br />
<div class="outline-text-6" id="text-1-1-3-1-8">
<ul class="org-ul">
<li>Always activate the virtual environment when working on the project.</li>
<li>Use tools like `venv`, `virtualenv`, or `conda` to create and manage environments.</li>
<li>Leverage environment management tools like `direnv` for seamless activation.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
