org/PythonSetup.org
*** Overview

We provides some guidance on installing Python.

#+begin_note
If you're a student in one of my courses, please make sure you install the
correct release of Python, as listed in Table [[tab:PyVersion]].

#+name: tab:PyVersion
#+caption: Python versions for various courses.
|------+----------+-------------------+---------|
| Year | Semester | Course            | Release |
|------+----------+-------------------+---------|
| 2025 | Spring   | Quantum Computing |    3.11 |
|------+----------+-------------------+---------|
| 2024 | Spring   | Quantum Computing |    3.10 |
|------+----------+-------------------+---------|
#+end_note

There are two ways I suggest for installing Python:
1. Using [[https://anaconda.org][Anaconda]]
2. Using standard Python from [[https://www.python.org/downloads/][python.org]]

#+begin_info
I recommend using Anaconda or Miniconda. They provide the flexibility to create environments with a specific Python version, even if you don't have that version installed yet. With standard Python, you can only create a virtual environment using a Python version that you already have installed.

Miniconda is simply a stripped-down version of Anaconda. [[https://docs.anaconda.com/getting-started/][Getting Started with
Anaconda]] has some discussion on when to choose one version over the other.

The video tutorial here does not include a Linux installation, nor does it
discuss installing Miniconda.
#+end_info

#+caption: Warning
#+begin_warning
A warning about this video: I did not illustrate how to get a specific version
of Python, so when using ~conda create ...~, please add ~python=3.XX~, where ~xx~ is the appropriate release
number.
#+end_warning

#+begin_export html
<iframe width="560" height="315" src="https://www.youtube.com/embed/0YIpRSXcUJI?si=ZIhi8UJn-TCyarHp" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
#+end_export

*** Anaconda Installation

#+begin_info
I recommend the Anaconda installation over Miniconda and standard Python. In
fact, most or all of the instructions in these tutorials assume you have
installed Anaconda, and you have the Anaconda Navigator included with Anaconda.
#+end_info
**** Mac OS
I'm a Mac user, so I know this one best.

#+begin_info
I recommend using the command-line installation. This has worked best for me in
terms of adding packages.
#+end_info

- From the download page, you can choose "[[https://www.anaconda.com/download#downloads/success][Get additional installers]]"
  - You can use the *Skip registration* link, or you may register your e-mail if
    you wish.
- Get the “Command Line Installer” appropriate for your computer
  - Intel processor: pick “64-Bit (Intel chip) Command Line ...”
  - Apple processor: pick “64-Bit (Apple silicon) Command Line ...”

∗ Follow the Mac [[https://docs.anaconda.com/free/anaconda/install/mac-os/#command-line-install][Command line install]] instructions
**** Windows
You can either install Anaconda/Miniconda natively in Windows, or you can use
[[https://learn.microsoft.com/en-us/windows/wsl/install][WSL]] to install it in Linux on your Windows machine.

For a windows installation:
- Go to the [[https://www.anaconda.com/download#downloads/success][Anaconda download]] page
  - Skip the registration, or register your e-mail as you see fit
**** UNIX/Linux
You are on your own, but I think it should be pretty straight-forward.
*** Miniconda Installation
I do not recommend a Miniconda installation at this time. However, if your
computer is tight on storage, this may be a better option than Anaconda.

#+begin_info
If you're a Windows user, I recommend Anaconda over Miniconda, sinc the Anaconda
Navigator app also includes a PowerShell prompt, where you can use terminal
commands to create enviroments and install packages.
#+end_info
I've never done this yet, but the Miniconda installers are on the [[https://www.anaconda.com/download/success][Anaconda
download]] page. You just have to scroll past the Anaconda installers.

There are [[https://docs.anaconda.com/miniconda/install/][installation instructions]] for Miniconda, with a procedure for
command-line installation.
*** Standard Python Installation
I do not recommend this installation at this time.

Visit the [[https://www.python.org/downloads/][download page]] and get the version of Python you wish to use.

Make sure you get the correct version if you're in one of my courses. Table
[[tab:PyVersion]] is a listing of my courses along with the required Python version.

** Test Your Python Installation
Let us test your Python operationally. A nice way to run Python is in Jupyter
Lab. To run Python, you can do the following
- On a Mac
  - Open a Terminal window
  - type ~jupyter lab~ followed by ~RETURN~ to launch Jupyter Lab
- On a PC
  - Start the Anaconda Navigator
  - Launch Jupyter Lab
- Once you have opened Jupyter Lab, a new web browser will arise with a Jupyter Lab graphical interface
  - You can begin coding once the Jupyter Lab window is open!

If you need help starting Jupyter Lab, please see my video
   #+begin_export html
   <iframe width="560" height="315" src="https://www.youtube.com/embed/dviOML11TqE?si=SMM-LUYWGB0w_mtl" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
   #+end_export
*** A Hello World Program
Try using the code of Listing [[lst:helloworld]] as starting code.

#+name: lst:helloworld
#+caption: A "hello world" program is traditionally a beginner's first prgram in any new language.
#+begin_src python :exports both :results output -n
  print('hello world')
#+end_src

- Observations:
  - There is a ~print()~ command with a single argument
  - That argument is a ~string~, which is a sequence of characters
  - You can define a ~string~ by putting the character sequence between a pair
    single quotes (~'some text'~) or double quotes (i.e, ~"some text"~ - chose
    one or the other, but not both to define your ~string~)
  - ~print()~ does one thing: it makes the input ~string~ visible in the Python
    output

