html/PythonSetup.html
<div id="outline-container-orgb314eea" class="outline-3">
<h3 id="orgb314eea"><span class="section-number-3">1.2.</span> Procedure</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge5762a7" class="outline-4">
<h4 id="orge5762a7"><span class="section-number-4">1.2.1.</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
We provides some guidance on installing Python.
</p>

<div class="note" id="orgd605e17">
<p>
If you're a student in one of my courses, please make sure you install the
correct release of Python, as listed in Table <a href="#orgd7e373b">1</a>.
</p>

<table id="orgd7e373b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Python versions for various courses.</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Year</th>
<th scope="col" class="org-left">Semester</th>
<th scope="col" class="org-left">Course</th>
<th scope="col" class="org-right">Release</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2025</td>
<td class="org-left">Spring</td>
<td class="org-left">Quantum Computing</td>
<td class="org-right">3.11</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2024</td>
<td class="org-left">Spring</td>
<td class="org-left">Quantum Computing</td>
<td class="org-right">3.10</td>
</tr>
</tbody>
</table>

</div>

<p>
There are two ways I suggest for installing Python:
</p>
<ol class="org-ol">
<li>Using <a href="https://anaconda.org">Anaconda</a></li>
<li>Using standard Python from <a href="https://www.python.org/downloads/">python.org</a></li>
</ol>

<div class="info" id="org5cd9525">
<p>
I recommend using Anaconda or Miniconda. They provide the flexibility to create environments with a specific Python version, even if you don't have that version installed yet. With standard Python, you can only create a virtual environment using a Python version that you already have installed.
</p>

<p>
Miniconda is simply a stripped-down version of Anaconda. <a href="https://docs.anaconda.com/getting-started/">Getting Started with
Anaconda</a> has some discussion on when to choose one version over the other.
</p>

<p>
The video tutorial here does not include a Linux installation, nor does it
discuss installing Miniconda.
</p>

</div>

<div class="warning" id="org1e4811a">
<p>
A warning about this video: I did not illustrate how to get a specific version
of Python, so when using <code>conda create ...</code>, please add <code>python=3.XX</code>, where <code>xx</code> is the appropriate release
number.
</p>

</div>

<iframe width="560" height="315" src="https://www.youtube.com/embed/0YIpRSXcUJI?si=ZIhi8UJn-TCyarHp" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-org4a589db" class="outline-4">
<h4 id="org4a589db"><span class="section-number-4">1.2.2.</span> Anaconda Installation</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="info" id="orgbb4bba3">
<p>
I recommend the Anaconda installation over Miniconda and standard Python. In
fact, most or all of the instructions in these tutorials assume you have
installed Anaconda, and you have the Anaconda Navigator included with Anaconda.
</p>

</div>
</div>
<ol class="org-ol">
<li><a id="org45f053d"></a>Mac OS<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
I'm a Mac user, so I know this one best.
</p>

<div class="info" id="orgd8a86e4">
<p>
I recommend using the command-line installation. This has worked best for me in
terms of adding packages.
</p>

</div>

<ul class="org-ul">
<li>From the download page, you can choose "<a href="https://www.anaconda.com/download#downloads/success">Get additional installers</a>"
<ul class="org-ul">
<li>You can use the <b>Skip registration</b> link, or you may register your e-mail if
you wish.</li>
</ul></li>
<li>Get the “Command Line Installer” appropriate for your computer
<ul class="org-ul">
<li>Intel processor: pick “64-Bit (Intel chip) Command Line &#x2026;”</li>
<li>Apple processor: pick “64-Bit (Apple silicon) Command Line &#x2026;”</li>
</ul></li>
</ul>

<p>
∗ Follow the Mac <a href="https://docs.anaconda.com/free/anaconda/install/mac-os/#command-line-install">Command line install</a> instructions
</p>
</div>
</li>
<li><a id="org2e649fe"></a>Windows<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
You can either install Anaconda/Miniconda natively in Windows, or you can use
<a href="https://learn.microsoft.com/en-us/windows/wsl/install">WSL</a> to install it in Linux on your Windows machine.
</p>

<p>
For a windows installation:
</p>
<ul class="org-ul">
<li>Go to the <a href="https://www.anaconda.com/download#downloads/success">Anaconda download</a> page
<ul class="org-ul">
<li>Skip the registration, or register your e-mail as you see fit</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orgf0babab"></a>UNIX/Linux<br />
<div class="outline-text-5" id="text-1-2-2-3">
<p>
You are on your own, but I think it should be pretty straight-forward.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0399c3c" class="outline-4">
<h4 id="org0399c3c"><span class="section-number-4">1.2.3.</span> Miniconda Installation</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
I do not recommend a Miniconda installation at this time. However, if your
computer is tight on storage, this may be a better option than Anaconda.
</p>

<div class="info" id="org11e8500">
<p>
If you're a Windows user, I recommend Anaconda over Miniconda, sinc the Anaconda
Navigator app also includes a PowerShell prompt, where you can use terminal
commands to create enviroments and install packages.
</p>

</div>
<p>
I've never done this yet, but the Miniconda installers are on the <a href="https://www.anaconda.com/download/success">Anaconda
download</a> page. You just have to scroll past the Anaconda installers.
</p>

<p>
There are <a href="https://docs.anaconda.com/miniconda/install/">installation instructions</a> for Miniconda, with a procedure for
command-line installation.
</p>
</div>
</div>
<div id="outline-container-orga397b21" class="outline-4">
<h4 id="orga397b21"><span class="section-number-4">1.2.4.</span> Standard Python Installation</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
I do not recommend this installation at this time.
</p>

<p>
Visit the <a href="https://www.python.org/downloads/">download page</a> and get the version of Python you wish to use.
</p>

<p>
Make sure you get the correct version if you're in one of my courses. Table
<a href="#orgd7e373b">1</a> is a listing of my courses along with the required Python version.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd303da5" class="outline-3">
<h3 id="orgd303da5"><span class="section-number-3">1.3.</span> Test Your Python Installation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let us test your Python operationally. A nice way to run Python is in Jupyter
Lab. To run Python, you can do the following
</p>
<ul class="org-ul">
<li>On a Mac
<ul class="org-ul">
<li>Open a Terminal window</li>
<li>type <code>jupyter lab</code> followed by <code>RETURN</code> to launch Jupyter Lab</li>
</ul></li>
<li>On a PC
<ul class="org-ul">
<li>Start the Anaconda Navigator</li>
<li>Launch Jupyter Lab</li>
</ul></li>
<li>Once you have opened Jupyter Lab, a new web browser will arise with a Jupyter Lab graphical interface
<ul class="org-ul">
<li>You can begin coding once the Jupyter Lab window is open!</li>
</ul></li>
</ul>

<p>
If you need help starting Jupyter Lab, please see my video
</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/dviOML11TqE?si=SMM-LUYWGB0w_mtl" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
</div>
<div id="outline-container-org71b7876" class="outline-4">
<h4 id="org71b7876"><span class="section-number-4">1.3.1.</span> A Hello World Program</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Try using the code of Listing <a href="#orgae98404">1</a> as starting code.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>A "hello world" program is traditionally a beginner's first prgram in any new language.</label><pre class="src src-python" id="org8407565"><span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">'hello world'</span>)
</pre>
</div>

<pre class="example">
hello world
</pre>


<ul class="org-ul">
<li>Observations:
<ul class="org-ul">
<li>There is a <code>print()</code> command with a single argument</li>
<li>That argument is a <code>string</code>, which is a sequence of characters</li>
<li>You can define a <code>string</code> by putting the character sequence between a pair
single quotes (<code>'some text'</code>) or double quotes (i.e, <code>"some text"</code> - chose
one or the other, but not both to define your <code>string</code>)</li>
<li><code>print()</code> does one thing: it makes the input <code>string</code> visible in the Python
output</li>
</ul></li>
</ul>
</div>
</div>
