org/PythonSetup.org
*** Python Version Check
- Another check you can perform is to make Python print its version, as shown
  in Listing [[lst:verCheck]]
  - We see that I'm using Python 3, version 3.11.7.
  - The ~#~ character is the beginning of an inline comment
    - The ~#~ character an any subsequent characters in that line of code are
      not evaluated
    - Comments are strictly for the human reader to aid in code understandability
      (very important)
    - Comments clarify code to others and clarify a thought process to oneself
#+name: lst:verCheck
#+caption: This code uses the built-in ~sys~ package to query the Python version.
#+begin_src python :results output :exports both
  import sys # make the sys package available for use
  print(sys.version) # print the version information
#+end_src

#+RESULTS: lst:verCheck
: 3.11.7 (main, Dec 15 2023, 12:09:56) [Clang 14.0.6 ]

* Set Up a Python Environment

** Overview
We will create a Python environment in Conda, and we will equip that environment
with packages which extend its capabilities. This is a video tutorial:

#+begin_note
Please note: please use =pip install ...=, even though this video demonstrates
~conda install ...~.
#+end_note

#+begin_export html
  <iframe width="560" height="315" src="https://www.youtube.com/embed/owtKH9MPrtE?si=o9ZwmcIV1ppoUswo" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
#+end_export

The following sections provide detailed instructions for setting up an
enviornment using ~conda~.

** Conda: Create an Environment
To create an environment:

1. Open a terminal application
   1. On Windows, start the Anaconda Navigator and launch the Powershell
      application
   2. On a Mac, open a Terminal (or iTerm2) window
2. In the terminal, type =conda create --name <EnvName> python=3.XX=
   and press RETURN (ENTER) to execue the command
   1. Here, you replace =<EnvName>= the the specific name you choose for
      your environment
   2. Short, simple names will be most effective
3. This creates your environment and specifies that we want to use
   Python 3.XX, where you replace =XX= by the numerical value from Table
   [[tab:PyVersion]]
   1. Newer versions of Python may not work well with Qiskit
4. You can verify that your environment is created by typing
   =conda info --envs=
   1. If the environment appears in the resulting list, you have
      successfully created it
   2. Otherwise, you may need to try again

** Activate your Environment (Conda)
- After creating your environment--especially if this is the first
   environment youve created--it is likely that your base environment
   is active. This means your new environment is _not_ active.
- You can tell this by looking at the start of your prompt string
  - If it says =(base)=, then, then your base environment is active

To activate you environment:
1. Type the following at the Powershell or Terminal
  prompt:
  #+begin_src shell :eval never
    conda activate <EnvName>
  #+end_src

   1. This activates your environment so that you can:
      1. install packages or
      2. use the packages you previously installed in that environment
#+begin_info
You can deactivate your environment by typing =conda deactivate= at
the Powershell/Terminal prompt, but don't do that yet. We need to keep our
environment active so we can extend it by installing packages.
#+end_info

** Installing Packages
We will install the packages you need for this course. The preferred way will be
to use the ~requirements.txt~ file, which installs all the packages I want you
to have. If that fails, we can try the manual method.
*** Install Packages from ~requirements.txt~ (Recommended)

This repository elateive to the

*** Manual Install
If you're here, we may assume your install from ~requirements.txt~ failed, or
you just want to do things the hard(er) way.
- For this course, you must install packages for your new environment
- Here, we will focus on the following:
  - =jupyterlab= - allows for an interactive session in your new
    environment (its installed by default in the =base= environment)

  - =qiskit= - allows you to develop quantum computing circuits

  - =qiskit-aer= - allows you to simulate quantum circuits

  - =matplotlib= - helps you visualize quantum circuits

  - =pylatexenc= - helps you visualize quantum circuits in a nicer
    way than the default

- For a walk-through on the package installation, see my video
  [[https://youtu.be/MQUu_ZwxViA][A Python Environment for Quantum
  Computing]]

  - To install packages in an environment:

    - Open the Powershell or Terminal as needed

    - Activate the desired environment

    - For each package to be installed:

      - First, try typing =conda install <packagename>=

        - When prompted, type =y= + =RETURN=

  - Troubleshooting

    - If =conda install <packagename>= doesnt work (you see a failed to
      resolve the environment, try searching for a specific
      installation command, such as
      =conda install conda-forge::pylatexenc= in the case of
      =pylatexenc=

      - This points example points to an installation on the
        =conda-forge= package collection

    - If =conda install ...= fails despite specifying a package
      collection, try installing with =pip= instead of =conda=


