html/PythonSetup.html

<div id="outline-container-org2dfc9d8" class="outline-4">
<h4 id="org2dfc9d8"><span class="section-number-4">1.3.2.</span> Python Version Check</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Another check you can perform is to make Python print its version, as shown
in Listing <a href="#orgb0ec97f">1</a>
<ul class="org-ul">
<li>We see that I'm using Python 3, version 3.11.7.</li>
<li>The <code>#</code> character is the beginning of an inline comment
<ul class="org-ul">
<li>The <code>#</code> character an any subsequent characters in that line of code are
not evaluated</li>
<li>Comments are strictly for the human reader to aid in code understandability
(very important)</li>
<li>Comments clarify code to others and clarify a thought process to oneself</li>
</ul></li>
</ul></li>
</ul>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>This code uses the built-in <code>sys</code> package to query the Python version.</label><pre class="src src-python" id="org8e988e5"><span style="color: #F0DFAF; font-weight: bold;">import</span> sys <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">make the sys package available for use</span>
<span style="color: #DCDCCC; font-weight: bold;">print</span>(sys.version) <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">print the version information</span>
</pre>
</div>

<pre class="example">
3.11.7 (main, Dec 15 2023, 12:09:56) [Clang 14.0.6 ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org48b696a" class="outline-2">
<h2 id="org48b696a"><span class="section-number-2">2.</span> Set Up a Python Environment</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1ecd347" class="outline-3">
<h3 id="org1ecd347"><span class="section-number-3">2.1.</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We will create a Python environment in Conda, and we will equip that environment
with packages which extend its capabilities. This is a video tutorial:
</p>

<div class="note" id="orgc78672c">
<p>
Please note: please use <code>pip install ...</code>, even though this video demonstrates
<code>conda install ...</code>.
</p>

</div>

<iframe width="560" height="315" src="https://www.youtube.com/embed/owtKH9MPrtE?si=o9ZwmcIV1ppoUswo" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

<p>
The following sections provide detailed instructions for setting up an
enviornment using <code>conda</code>.
</p>
</div>
</div>

<div id="outline-container-org2e79bc1" class="outline-3">
<h3 id="org2e79bc1"><span class="section-number-3">2.2.</span> Conda: Create an Environment</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To create an environment:
</p>

<ol class="org-ol">
<li>Open a terminal application
<ol class="org-ol">
<li>On Windows, start the Anaconda Navigator and launch the Powershell
application</li>
<li>On a Mac, open a Terminal (or iTerm2) window</li>
</ol></li>
<li>In the terminal, type <code>conda create --name &lt;EnvName&gt; python=3.XX</code>
and press RETURN (ENTER) to execue the command
<ol class="org-ol">
<li>Here, you replace <code>&lt;EnvName&gt;</code> the the specific name you choose for
your environment</li>
<li>Short, simple names will be most effective</li>
</ol></li>
<li>This creates your environment and specifies that we want to use
Python 3.XX, where you replace <code>XX</code> by the numerical value from Table
<a href="#orgd7e373b">1</a>
<ol class="org-ol">
<li>Newer versions of Python may not work well with Qiskit</li>
</ol></li>
<li>You can verify that your environment is created by typing
<code>conda info --envs</code>
<ol class="org-ol">
<li>If the environment appears in the resulting list, you have
successfully created it</li>
<li>Otherwise, you may need to try again</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org3186b94" class="outline-3">
<h3 id="org3186b94"><span class="section-number-3">2.3.</span> Activate your Environment (Conda)</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>After creating your environment&#x2013;especially if this is the first
environment youve created&#x2013;it is likely that your base environment
is active. This means your new environment is <span class="underline">not</span> active.</li>
<li>You can tell this by looking at the start of your prompt string
<ul class="org-ul">
<li>If it says <code>(base)</code>, then, then your base environment is active</li>
</ul></li>
</ul>

<p>
To activate you environment:
</p>
<ol class="org-ol">
<li><p>
Type the following at the Powershell or Terminal
prompt:
</p>
<div class="org-src-container">
<pre class="src src-shell">conda&#160;activate&#160;&lt;EnvName&gt;
</pre>
</div>

<ol class="org-ol">
<li>This activates your environment so that you can:
<ol class="org-ol">
<li>install packages or</li>
<li>use the packages you previously installed in that environment</li>
</ol></li>
</ol></li>
</ol>
<div class="info" id="orgb73cb5c">
<p>
You can deactivate your environment by typing <code>conda deactivate</code> at
the Powershell/Terminal prompt, but don't do that yet. We need to keep our
environment active so we can extend it by installing packages.
</p>

</div>
</div>
</div>

<div id="outline-container-org6c7b651" class="outline-3">
<h3 id="org6c7b651"><span class="section-number-3">2.4.</span> Installing Packages</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We will install the packages you need for this course. The preferred way will be
to use the <code>requirements.txt</code> file, which installs all the packages I want you
to have. If that fails, we can try the manual method.
</p>
</div>
<div id="outline-container-org904c430" class="outline-4">
<h4 id="org904c430"><span class="section-number-4">2.4.1.</span> Install Packages from <code>requirements.txt</code> (Recommended)</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
This repository elateive to the
</p>
</div>
</div>

<div id="outline-container-orgc59427a" class="outline-4">
<h4 id="orgc59427a"><span class="section-number-4">2.4.2.</span> Manual Install</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
If you're here, we may assume your install from <code>requirements.txt</code> failed, or
you just want to do things the hard(er) way.
</p>
<ul class="org-ul">
<li>For this course, you must install packages for your new environment</li>
<li>Here, we will focus on the following:
<ul class="org-ul">
<li><code>jupyterlab</code> - allows for an interactive session in your new
environment (its installed by default in the <code>base</code> environment)</li>

<li><code>qiskit</code> - allows you to develop quantum computing circuits</li>

<li><code>qiskit-aer</code> - allows you to simulate quantum circuits</li>

<li><code>matplotlib</code> - helps you visualize quantum circuits</li>

<li><code>pylatexenc</code> - helps you visualize quantum circuits in a nicer
way than the default</li>
</ul></li>

<li>For a walk-through on the package installation, see my video
<a href="https://youtu.be/MQUu_ZwxViA">A Python Environment for Quantum
Computing</a>

<ul class="org-ul">
<li>To install packages in an environment:

<ul class="org-ul">
<li>Open the Powershell or Terminal as needed</li>

<li>Activate the desired environment</li>

<li>For each package to be installed:

<ul class="org-ul">
<li>First, try typing <code>conda install &lt;packagename&gt;</code>

<ul class="org-ul">
<li>When prompted, type <code>y</code> + <code>RETURN</code></li>
</ul></li>
</ul></li>
</ul></li>

<li>Troubleshooting

<ul class="org-ul">
<li>If <code>conda install &lt;packagename&gt;</code> doesnt work (you see a failed to
resolve the environment, try searching for a specific
installation command, such as
<code>conda install conda-forge::pylatexenc</code> in the case of
<code>pylatexenc</code>

<ul class="org-ul">
<li>This points example points to an installation on the
<code>conda-forge</code> package collection</li>
</ul></li>

<li>If <code>conda install ...</code> fails despite specifying a package
collection, try installing with <code>pip</code> instead of <code>conda</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dr. E.P. Blair</p>
<p class="date">Created: 2025-01-17 Fri 10:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
